config/doom/config.org
:PROPERTIES:
:ID:       58399678-8569-4be7-ae77-2374c1ad7825
:END:
#+TITLE: Elian's Doom Emacs Config

* Configuration
** Initial setup
#+begin_src emacs-lisp :tangle ./config.el
(setq user-full-name "Elian Manzueta")
(setq user-mail-address "elianmanzueta@protonmail.com")
(setq auto-save-default t
      make-backup-files t)
(setq display-line-numbers-type 'relative)
(setq confirm-kill-emacs nil)
(setq evil-shift-width 2)
#+end_src
** Theme and fonts
#+BEGIN_SRC emacs-lisp :tangle ./config.el
(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 18))
(setq doom-theme 'doom-monokai-spectrum)
#+END_SRC
** Terminal setup
** Org mode
#+BEGIN_SRC emacs-lisp :tangle ./config.el
(setq org-directory "~/org/")
(setq org-agenda-files "~/org")
#+END_SRC
** Evil-snipe/Avy
Trying to =replicate= flash.nvim

#+BEGIN_SRC emacs-lisp :tangle ./config.el
(after! evil-snipe
  (evil-snipe-mode -1)
  (evil-snipe-override-mode -1))
#+END_SRC
** Treemacs
#+BEGIN_SRC emacs-lisp :tangle ./config.el
(after! treemacs
  (map! :leader "e" #'treemacs)
  )
#+END_SRC
** Kill-ring
#+BEGIN_SRC emacs-lisp :tangle ./config.el
(map! :leader "y" #'yank-from-kill-ring)
#+END_SRC
** Auto-fill Mode
#+BEGIN_SRC emacs-lisp :tangle ./config.el
(add-hook 'text-mode-hook #'auto-fill-mode)
(setq-default fill-column 80)
#+END_SRC
